of9/SbmBloodTubeFoam/tutorials/2DTubeBlood_Flow/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0) 
    (0.02 0 0) 
    (0.02 0.00002 -7.0e-07) 
    (0 0.00002 -7.0e-07)
    (0.02 0.00002 7.0e-07) 
    (0 0.00002 7.0e-07)
);

blocks
(
    hex (0 1 2 3 0 1 4 5) (200 18 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
     {
        type patch;
        faces
        (
            (0 3 5 0)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 4 1)
        );
    }
    walls
    {
        type wall;
        faces
        (            
            (3 2 4 5)           
        );
    }
    axis
    {
        type empty;
        faces
        (
            (0 1 1 0)           
        );
    }
    wFront
    {
        type wedge;
        faces
        (
            (0 1 4 5)           
        );
    }
    
    wBack
    {
        type wedge;
        faces
        (
            (0 1 2 3)          
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
