of9/SbmBloodTubeFoam/tutorials/2DTubeBlood_Flow/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-12;
        relTol           0.05;
    }

    pFinal
    {
        $p;
        tolerance       1e-10;
        relTol          0;
    }


    U
    {
        solver            PCG;
        preconditioner 	  DIC;
        tolerance         1e-10;
        relTol            0.1;
    }

    UFinal
    {
        $U;
        tolerance       1e-10;
        relTol          0;
    }

    c
    {
        solver            PBiCG;
        preconditioner    DILU;
        tolerance         1e-11;
        relTol            0.1;
    }
}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}
relaxationFactors
{
    p               0.3;
    U               0.7;

}

// ************************************************************************* //
